// lab19.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");
	int arr[20][20], N, M, min, max, i, j, b, c, d = 0, f = 0, g = 0;
	cout << "Enter M:";
	cin >> M;
	cout << "Enter N:";
	cin >> N;
	cout << "введите матрицу" << endl;
	for (i = 0; i < M; i++)
	{
		for (j = 0; j < N; j++)
			cin >> arr[i][j];

	}
	b = arr[1][1];
	c = arr[1][1];
	for (i = 0; i < M; i++)
	{
		for (j = 0; j < N; j++)
		{
			if (arr[i][j] > b)
			{
				b = arr[i][j];
				d = j;
			}
			if (arr[i][j] < c)
			{
				c = arr[i][j];
				f = j;
			}
		}
	}
	for (i = 0; i < N; i++)
	{
		g = arr[i][d];
		arr[i][d] = arr[i][f];
		arr[i][f] = g;
	}
	cout << "Max:   " << b;
	cout << "Min:   " << c;
	for (i = 0; i < N; i++)
	{
		for (j = 0; j < M; j++)
		{
			cout << arr[i][j] << " ";
		}
		cout << endl;
	}
	cout << endl;
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
