// lab19.5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int m, i, j, k, c, sum;
	cout << "Введите m";
	cin >> m;
	cout << "введите матрицу";
	int** a = new int* [m];
	for (i = 1; i <= m; i++)
		a[i] = new int[m];
	for (i = 1; i <= m; i++)
		for (j = 1; j <= m; j++)
			cin >> a[i][j];

	for (i = 1; i <= m; i++) {
		for (j = 1; j <= m; j++)
			cout << a[i][j];
	}
	c = m;
	sum = 0;
	for (k = 1; k <= (m * 2 - 1); k++) {
		for (i = 1; i <= m; i++)
			for (j = 1; j <= m; j++)
				if (i == j + c - 1)
					sum += a[i][j];
		cout << "сумма  диагонали " << sum<<"\t";
		sum = 0;
		c--;
	}
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
