// lab19.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
// н.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <stdio.h>
#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	int n, m, i, j, c, min, max, d, b;
	cout << "Введите m и n: ";
	cin >> m >> n;
	c = 0;
	d = 0;
	b = 0;
	min = INT_MAX;
	max = INT_MIN;
	int** mat = new int* [n];
	for (i = 0; i < n; i++) {
		mat[i] = new int[m];
	}
	cout << "Введите элементы матрицы:";
	for (i = 0; i < n; i++) {
		for (j = 0; j < m; j++) {
			cin >> mat[i][j];
		}
	}
	for (i = 0; i < n; i++)
	{
		for (j = 0; j < m; j++)
		{
			if (mat[i][j] < min)
			{
				min = mat[i][j];
				d = j;
			}
			if (mat[i][j] > max)
			{
				max = mat[i][j];
				b = j;
			}
		}
	}
	for (i = 0; i < n; i++)
	{
		c = mat[i][b];
		mat[i][b] = mat[i][d];
		mat[i][d] = c;
	}
	cout << "Преобразованная матрица: " << endl;
	for (i = 0; i < n; i++) {
		for (j = 0; j < m; j++)
		{
			cout << mat[i][j];

		}
	}
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
