// lab19.4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int m, i, j, n, k, c;
	cout << "Введите m";
	cin >> m;
	cout << "введите n";
	cin >> n;
	cout << "введите матрицу " << endl;
	int** a = new int* [n];
	for (i = 0; i < n; i++)
		a[i] = new int[m];
	for (i = 0; i < n; i++)
		for (j = 0; j < m; j++)
			cin >> a[i][j];

	for (i = 0; i < n; i++) {
		for (j = 0; j < m; j++)
			cout << a[i][j];
	}
	for (i = 0; i < n; i++)
	{
		for (k = 1; k < n; k++)
		{
			if (a[k][1] > a[k + 1][1]) {
				for (j = 0; j < m; j++) {
					c = a[k][j];
					a[k][j] = a[k + 1][j];
					a[k + 1][j] = c;

				}
			}
		}
	}
	for (i = 0; i < n; i++) {
		for (j = 0; j < m; j++)
			cout << a[i][j];
		cout << endl;
	}
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
