// ееее.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()

{
	setlocale(LC_ALL, "Rus");
	int arr[20][20], M, f, i, j;
	cout << "введите м";
	cin >> M;
	cout << "введите матрицу";
	for (i = 0; i < M; i++)
	{

		for (j = 0; j < M; j++)
		{
			cin >> arr[i][j];

		}
	}
	for (f = 0; f < M / 2; f++)
	{
		for (i = f; i < M - f; ++i) { cout << arr[f][i]; }
		for (j = f + 1; j <= M - f - 1; ++j) { cout << arr[j][M - f - 1]; }
		for (i = M - f - 2; i >= f; --i) { cout << arr[M - f - 1][i]; }
		for (j = M - f - 2; j >= f + 1; --j) { cout << arr[j][f]; }
	}
	cout << arr[M / 2][M / 2] << endl;
	cout << endl;
	return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
