// lab18.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");
	int arr[20][20], K, N, M, s = 0, i, j, m = 1;
	cout << "введите M:";
	cin >> M;
	cout << "введите K:";
	cin >> K;
	cout << "введите N:";
	cin >> N;
	cout << "введите матрицу";
	for (i = 0; i < M; i++)
	{

		for (j = 0; j < N; j++)
		{

			cin >> arr[i][j];
		}
	}
	for (j = 0; j < N; j++)
	{
		s += arr[K - 1][j];
		m *= arr[K - 1][j];
	}
	cout << endl << "cумма " << s << endl << "произведение " << m << endl;

	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
