#include <iostream>
using namespace std;
int main()
{
	int c = 0, K, i, N, t = 0, j;
	setlocale(LC_ALL, "Rus");
	cout << "введите n";
	cin >> N;
	int* arr = new int[N];
	int* mass = new int[N];
	int* a = new int[N];
	cout << "введите массив";
	for (i = 0; i < N; i++)
	{
		cin >> arr[i];
	}
	for (i = 0; i < N; i++)
	{
		mass[i] = 1;
	}
	cout << "введите к";
	cin >> K;
	for (i = 0; i < N - 1; i++) {
		if (arr[i] != arr[i + 1]) {
			a[t] = arr[i];
			t++;
		}
		else {
			mass[t]++;

		}
	}
	if (arr[N - 1] == arr[N - 2])
	{
		a[t] = arr[N - 2];
	}
	else
	{
		a[t] = arr[N - 1];
		mass[t] = 1;
	}

	cout << endl;
	mass[0] += mass[K - 1];
	a[0] += a[K - 1];
	mass[K - 1] = mass[0] - mass[K - 1];
	a[K - 1] = a[0] - a[K - 1];
	mass[0] -= mass[K - 1];
	a[0] -= a[K - 1];

	for (i = 0; i <= t; i++)
	{

		for (j = 1; j <= mass[i]; j++)
		{
			cout << a[i] << " ";
		}
	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
