// ерерннррн.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	int N,k;
	cout << "введите n";
	cin >> N;
	int* a = new int[N];
	cout << "введмите массив";
	for (int i = 0; i < N; i++) {
		cin >> a[i];
	}
	int* b = new int[N];
	int* c = new int[N];
	k = 0;
	b[k] = 1;
	c[k] = a[k];
	for (int i = 0; i < N; i++) {
		if (a[i - 1] = a[i]) {
			b[k] = b[k] + 1;
		}
		else {
			k++;
			b[k] = 1;
			c[k] = a[i];
		}
	}
	for (int i = 0; i <= k; i++) {
		cout << c[i] <<"-"<< b[i];
	}

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
