// птттр.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//


using namespace std;
#include <iostream>
#include <cmath>

int main()
{
	setlocale(LC_ALL, "Rus");
	double arr[10][2];
	int N, i, j, a, b, c, f, p, g = 0;
	cout << "введите N:";
	cin >> N;
	for (i = 0; i < N; i++)
	{
		cout << "введите а" << i;
		cout << "x:";
		cin >> arr[i][0];
		cout << "y:";
		cin >> arr[i][1];
	}
	for (i = 0; i < N; i++)
	{
		for (j = i + 1; j < N; j++)
		{
			for (f = j + 1; f < N; f++)
			{
				p = 0;
				p += sqrt(pow(arr[i][0] - arr[j][0], 2) + pow(arr[i][1] - arr[j][1], 2));
				p += sqrt(pow(arr[i][0] - arr[f][0], 2) + pow(arr[i][1] - arr[f][1], 2));
				p += sqrt(pow(arr[j][0] - arr[f][0], 2) + pow(arr[j][1] - arr[f][1], 2));
				if (p > g)
				{
					a = i;
					b = j;
					c = f;
					g = p;
				}

			}
		}
	}
	if (g = p) {

		cout << "A :" << a + 1 << endl << "x:" << arr[a][0] << endl << "y:" << arr[a][1] << endl;
		cout << "A :" << b + 1 << endl << " x: " << arr[b][0] << endl << " y: " << arr[b][1] << endl;
		cout << "A :" << c + 1 << endl << " x: " << arr[c][0] << endl << " y: " << arr[c][1] << endl;
	}
	else
	{
		cout << "0:0" << endl;
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
