// lab22.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <stdio.h>
#include <cstdlib>
#include <fstream>
#include <iostream>
#include <string>
using namespace std;

int main()
{
	setlocale(LC_ALL, "RU");
	int l, a, N, K, i, j;
	string buff;
	char name[260];
	cin.getline(name, 260);
	strcat_s(name, ".txt");
	ofstream f(name);
	cout << "кол-во строк";
	cin >> N;
	cout << "кол-во *";
	cin >> K;
	for (i = 0; i < N; i++) {
		for (j = 0; j < K; j++)	f << "*";
		f << endl;
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
