
#include <iostream>
#include <string>
#include <Windows.h>
#include <fstream>
using namespace std;

int main()
{
	setlocale(LC_CTYPE, "ru");
	int l, a;
	string b;
	ifstream fin("lab22.1");
	getline(fin, b);
	fin.close();
	cout << b; 
	l = b.length();
	a = 0;
	for (int i = 0; i < l; i++) if (b[i] == ' ') {
		a = i;
		break;
	}
	b.erase(0, a + 1);
	cout << b << endl;
	ofstream fof("lab22.1");
	fof << b;

	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
