// alg1.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;


int main()
{
	setlocale(LC_ALL, "Russian");
	int a, b, c;
	cout << "введите 3 числа";
	cin >> a >> b >> c;
	if (2<a && a<5) {
		cout << "число а попадает в интервал ";
	}
	if (2 == a || a == 5) {
		cout << "число а лежит на границе интервала ";
	}
	if (a < 2 || a>5) {
		cout << "число а не входит в интервал ";
	}
	if (2 < b && b < 5) {
		cout << "число b попадает в интервал ";
	}
	if (2 == b || b == 5) {
		cout << "число b лежит на границе интервала ";
	}
	if (b < 2 || b>5) {
		cout << "число b не входит в интервал ";
	}
	if (2 < c && c < 5) {
		cout << "число c попадает в интервал ";
	}
	if (2 == c || c == 5) {
		cout << "число c лежит на границе интервала ";
	}
	if (c < 2 || c>5) {
		cout << "число c не входит в интервал ";
	}
	return 0;
	
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
