// alg1.3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;


int main()
{
	setlocale(LC_ALL, "Russian");
	int a;
	cout << "введите возраст";
	cin >> a;
	if ((a % 10 == 2) || (a % 10 == 3) || (a % 10 == 4)) {
		cout << a << "года";
	}
	else if ((a % 10 == 5) || (a % 10 == 6) || (a % 10 == 7) || (a % 10 == 8) || (a % 10 == 9) || (a % 10 == 9) || ((a >= 5 and a <= 20))) {
		cout<<a<<"лет";
	}
	else {
		cout<<a<<"год";
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
