
#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");
	int n;
	cout << "введите N:";
	cin >> n;
	int* a = new int[n];
	cout << "введите массив";
	for (int i = 0; i < n; i++)
	{
		cin >> a[i];
	}
	int c,k, num;
	for (int i = 0; i < n; i++) {
		num = 0;
		for (int j = 0; j < n; j++) {
			if (a[i] == a[j]) 
			num++;
		}
		if (num == 2) {
			k = i - 1;
			c = a[i];
			for (int j = i; j < n; j++)
				if (a[j] != c) {
					++k;
					a[k] = a[j];
				}
			n = k + 1;
			i--;
		}
	}

	for (int i=0; i<n;i++) {
		cout << a[i];
	}


}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
