//Дан целочисленный массив размера N.Удалить из массива все соседние одинаковые элементы, оставив их первые вхождения.
#include <iostream>
#include <cmath>
#include <stdio.h>
#include <stdlib.h>

using namespace std;


int main()
{
	setlocale(LC_ALL, "Rus");
	int N;
	cout << "ввести N";
	cin >> N;
	int* mas = new int[N];
	cout << "ввемсти массив";
	for (int i=0; i<N;i++) {
		cin>>mas[i];
	}
	int a = 0;
	for (int i = 0; i < N; i++) {
		if (mas[a] != mas[i]) {
			a++;
			mas[a] = mas[i];
			
		}
	}
	for (int i = 0; i <= a; i++)
	{
		cout << mas[i] << "\t ";
	}
}






// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
