// lab15.1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	int N;
	int c;
	cout << "введите N";
	cin >> N;
	int* a = new int[N];
	int* b = new int[N];
	cout << "введите массив а";
	for (int i = 0; i <= N - 1; i++) {
		cin >> a[i];
	}
	cout << "введите массив b";
	for (int i = 0; i <= N - 1; i++) {
		cin >> b[i];
	}
	for (int i = 0; i <= N - 1; i++) {
		c = a[i];
		a[i] = b[i];
		b[i] = c;
		cout << a[i];
	}
	for (int i = 0; i <= N - 1; i++) {
		c = a[i];
		a[i] = b[i];
		b[i] = c;
		cout << a[i];
	}
	
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
