// lab9.1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int a, b;
	cout << "введите номер дня и номер месяца";
	cin >> a >> b;
	if (a == 1) {
		cout<<"первое ";
	}
	if (a == 2) {
		cout << "второе ";
	}
	if (a == 3) {
		cout << "третье ";
	}
	if (a == 4) {
		cout << "четвертое ";
	}
	if (a == 5) {
		cout << "пятое ";
	}
	if (a == 6) {
		cout << "шестое ";
	}
	if (a == 7) {
		cout << "седьмое ";
	}
	if (a == 8) {
		cout << "восьмое ";
	}
	if (a == 9) {
		cout << "девятое ";
	}
	if (a == 10) {
		cout << "десятое ";
	}
	if (a == 11) {
		cout << "одиннадцатое ";
	}
	if (a == 12) {
		cout << "тринадцатое ";
	}
	if (a == 14) {
		cout << "четырнадцатое ";
	}
	if (a == 15) {
		cout << "пятнадцатое ";
	}
	if (a == 16) {
		cout << "шестнадцатое ";
	}
	if (a == 17) {
		cout << "семнадцатое ";
	}
	if (a == 18) {
		cout << "восемнадцатое ";
	}
	if (a == 19) {
		cout << "девятнадцатое ";
	}
	if (a == 20) {
		cout << "двадцатое ";
	}
	if (a == 21) {
		cout << "двадцать первое ";
	}
	if (a == 22) {
		cout << "двадцать второе ";
	}
	if (a == 23) {
		cout << "двадцать третье ";
	}
	if (a == 24) {
		cout << "двадцать четвертое ";
	}
	if (a == 25) {
		cout << "двадцать пятое ";
	}
	if (a == 26) {
		cout << "двадцать шестое ";
	}
	if (a == 27) {
		cout << "двадцать седьмое ";
	}
	if (a == 28) {
		cout << "двадцать восьмое ";
	}
	if (a == 29) {
		cout << "двадцать девятое ";
	}
	if (a == 30) {
		cout << "тридцатое ";
	}
	if (a == 31) {
		cout << " тридцать первое ";
	}
	if (b == 1) {
		cout << "января ";
	}
	if (b == 2) {
		cout << "февраля ";
	}
	if (b == 3) {
		cout << "марта ";
	}
	if (b == 4) {
		cout<<"апреля ";
	}
	if (b == 5) {
		cout << "мая ";
	}
	if (b == 6) {
		cout << "июня ";
	}
	if (b == 7) {
		cout << "июля ";
	}
	if (b == 8) {
		cout << "августа ";
	}
	if (b == 9) {
		cout << "сентября ";
	}
	if (b == 10) {
		cout << "октября ";
	}
	if (b == 11) {
		cout << "ноября ";
	}
	if (b == 12) {
		cout << "декабря ";
	}


	
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
