// lab9.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int C, N;
	cout << "Введите исходное направление робота";
	cin >> C;
	cout << "Введите посланную ему команду";
	cin >> N;
	if (C == 0) {
		if (N == 0) {
			cout << "робот направлен на север";
		}
		if (N == 1) {
			cout << "робот направлен на запад";
		}
		if (N == -1) {
			cout << "робот направлен на восток";
		}
	}
	if (C == 1) {
		if (N == 0) {
			cout << "робот направлен на запад";
		}
		if (N == 1) {
			cout << "робот направлен на юг";
		}
		if (N == -1) {
			cout << "робот направлен на север";
		}
	}
	if (C == -1) {
		if (N == 0) {
			cout << "робот направлен на восток";
		}
		if (N == 1) {
			cout << "робот направлен на север";
		}
		if (N == -1) {
			cout << "робот направлен на юг";
		}
	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
