// lab9.5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int N;
	cout << "Введите год :";
	cin >> N;
	switch (N % 5)
	{
	case 0:
		cout << "год красн"; break;
	case 1:
		cout << "год желт"; break;
	case 2:
		cout << "год бел"; break;
	case 3:
		cout << "год черн"; break;
	case 4:
		cout << "год зелен"; break;
	}
	switch ((N+8)% 12)
	{
	case 0: cout << "ой крысы"; break;
	case 1:cout << "ой коровы"; break;
	case 2: cout << "ого тигра"; break;
	case 3: cout << "ого зайца"; break;
	case 4: cout << "ого дракона"; break;
	case 5: cout << "ой змеи"; break;
	case 6: cout << "ой лошади"; break;
	case 7: cout << "ой овцы"; break;
	case 8: cout << "ой обезьяны"; break;
	case 9:cout << "ой курицы"; break;
	case 10:cout << "ой собаки"; break;
	case 11: cout << "ой свиньи"; break;
	}


}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
