// lab8.3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int x1,y1, x2,y2, x3,y3;
	float ab,ac;
	cout << "введите координаты 1 точки";
	cin >> x1>>y1;
	cout << "введите координаты 2 точки";
	cin >> x2>>y2;
	cout << "введите координаты 3 точки";
	cin >> x3>>y3;
	ab=sqrt(pow(x1-x2, 2)+(pow(y1-y2,2);
	ac=sqrt(pow(x1-x3,2)+(pow(y1-y3,2);
	if (ac > ab) {
		cout << "точка B ближе к точке A; ее расстояние от точки А = " << abs(a - b);
	}
	else {
		cout << "точка C ближе к точке A; ее расстояние от точки А = " << abs(a - c);
	}
	return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
