// lab21.4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");
	int a;
	string s;
	cout << "Введите строку" << endl;
	getline(cin, s);
	s.length();
	a = 0;
	for (int i = 0; i < s.length(); i++)
	{
		if (s[i] == 'а' || s[i] == 'е' || s[i] == 'ё' || s[i] == 'и' || s[i] == 'о' || s[i] == 'у' || s[i] == 'ы' || s[i] == 'э' || s[i] == 'ю' || s[i] == 'я')
		{
			a++;
		}
	}
	cout << a;
	return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
